Training/Rails/college/app/views/departments/new.html.erb

SELECT  "departments".* FROM "departments" ORDER BY "departments"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
      <%= form.label :id %>
      <%= form.text_field :id, :value => (Department.last.id + 1), :requiered => true, :readonly => true %>