Training/Rails/college/app/views/departments/show.html.erb

      <h4>HOD ID: <%=@department.hod_id%></h4>
      <h4>SECTIONS: <%@department.sections.each do |se|%>
---
SELECT "sections".* FROM "sections" WHERE "sections"."department_id" = $1  [["department_id", 1]]