Training/Ruby/Rails/college/app/controllers/departments_controller.rb

INSERT INTO "departments" ("name", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Computer Engineering"], ["teacher_id", 122], ["created_at", "2019-09-07 03:09:08.321977"], ["updated_at", "2019-09-07 03:09:08.321977"]]
---
  def create
    @department = Department.new(department_params)

    respond_to do |format|
      if @department.save