Training/Ruby/Rails/college/app/controllers/sections_controller.rb

INSERT INTO "sections" ("department_id", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["department_id", 1], ["teacher_id", 1], ["created_at", "2019-09-07 03:14:16.123579"], ["updated_at", "2019-09-07 03:14:16.123579"]]
---
  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save