Training/Ruby/Rails/college/app/controllers/teachers_controller.rb

  def create
    @teacher = Teacher.new(teacher_params)

    respond_to do |format|
      if @teacher.save
---
INSERT INTO "teachers" ("name", "dob", "experience", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Komal Bharia"], ["dob", "1969-07-08"], ["experience", 12], ["created_at", "2019-09-07 03:10:00.872249"], ["updated_at", "2019-09-07 03:10:00.872249"]]