Training/Rails/college/app/controllers/departments_controller.rb

  def index

    @departments = Department.all
---
SELECT "departments".* FROM "departments" ORDER BY "departments"."id" ASC

  def show
    @department = Department.find(params[:id].to_i)
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def create
    @department = Department.new(get_params)

    if @department.save
---
INSERT INTO "departments" ("name", "teacher_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Computer Engineering"], ["teacher_id", 122], ["created_at", "2019-09-07 03:09:08.321977"], ["updated_at", "2019-09-07 03:09:08.321977"]]

  def edit
    @department = Department.find(params[:id].to_i)
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

  def update
    @department = Department.find(params[:id].to_i)

    if @department.update(get_params)
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "departments" SET "name" = $1, "updated_at" = $2 WHERE "departments"."id" = $3  [["name", "Computer Engineering"], ["updated_at", "2019-09-12 10:49:20.835191"], ["id", 1]]

  def destroy
    @department = Department.find(params[:id].to_i)

    if @department.destroy
---
SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "departments" WHERE "departments"."id" = $1  [["id", 108]]