Training/Rails/college/app/controllers/login_controller.rb

    def verify
        email = params[:user][:email]
        password = params[:user][:password]

        @user = User.find_by(email:email, password:password)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 AND "users"."password" = $2 LIMIT $3  [["email", "hhss@gmail.com"], ["password", "jbsckjbscck"], ["LIMIT", 1]]