Training/Rails/college/app/controllers/sections_controller.rb

INSERT INTO "sections" ("department_id", "teacher_id", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["department_id", 1], ["teacher_id", 1], ["created_at", "2019-09-07 05:22:36.065293"], ["updated_at", "2019-09-07 05:22:36.065293"], ["name", "CE-2K19"]]
---
  def create
    @section = Section.new(get_params)
    redirect_to sections_path if @section.save

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @section = Section.find_by(id:params[:id].to_i)