Training/Rails/college/app/views/sections/show.html.erb

        <% id=request.path[10..-1].to_i%>
        <%section= Section.find(id)%>
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]