Training/Rails/college/app/views/_header.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---

    <pre> <a href="/">home</a>     <a href="/about">about</a>     <a href="/departments">departments</a>     <a href="/sections">sections</a>     <a href="/teachers">teachers</a>     <a href="/students">students</a>     <a href="/subjects">subjects</a>     <a href="/exams">examinations</a>     <a href="/contact">contact us</a>      <%if session[:user_id]==nil%><a href="/signup">Signup / Login</a><%else%><%= link_to  "My Account", user_path(User.find_by(id:session[:user_id]))%>      <%=link_to 'Logout' , logout_path,data: {confirm: "Are you sure you want to logout?"}, method: "delete" %><%end%></pre>